app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@testing.com"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: user_login_params[:email])