app/controllers/api/v1/inventories_controller.rb

  def show
    inventory = Inventory.find_by(params[:id])
---
SELECT "inventories".* FROM "inventories" WHERE (1) LIMIT $1  [["LIMIT", 1]]