app/controllers/api/v1/inventories_controller.rb

SELECT "inventories".* FROM "inventories"
---
  def index
    inventories = Inventory.all

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    inventory = Inventory.find_by(id: params[:id])