app/controllers/api/v1/items_controller.rb

SELECT "inventories".* FROM "inventories" WHERE "inventories"."item_id" = $1  [["item_id", 13]]
SELECT "items".* FROM "items"
---
  def index
    items = Item.includes(:inventory).all

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    item = Item.find_by(id: params[:id])