app/controllers/api/v1/items_controller.rb

SELECT "items".* FROM "items" WHERE (1) LIMIT $1  [["LIMIT", 1]]
---
  def show
    item = Item.find_by(params[:id])