app/controllers/api/v1/users_controller.rb

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "password_digest", "street_address", "city", "state", "zip_code", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"