app/controllers/application_controller.rb

  def current_user
    if decoded_token
      # decoded_token=> [{"user_id"=>1}, {"alg"=>"HS256"}]
      # or nil if we can't decode the token
      user_id = decoded_token[0]['user_id']
      user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]